; domain
;; Adapted from: https://github.com/josej30/Planner-Sat-Constraints
;; We use existential preconditions (exists) to remove as many parameters from the actions as possible

(define (domain logistics)

(:requirements :strips :typing :existential-preconditions) 

(:types  city location thing - object
         package vehicle - thing
         truck airplane - vehicle  
         airport - location)
  
(:predicates  (in-city ?l - location ?c - city)
              (at ?obj - thing ?l - location)
              (in ?p - package ?veh - vehicle))
  
(:action drive
         :parameters    (?t - truck ?from ?to - location)
         :precondition  (and 
                             (at ?t ?from)
                             (exists (?c - city)
                                (and (in-city ?from ?c) (in-city ?to ?c))
                              )
                         )
         :effect        (and (not (at ?t ?from))
                             (at ?t ?to)))

(:action fly
         :parameters    (?a - airplane ?from ?to - airport)
         :precondition  (at ?a ?from)
         :effect        (and (not (at ?a ?from))
                             (at ?a ?to)))

(:action load
         :parameters    (?v - vehicle ?p - package ?l - location)
         :precondition  (and (at ?v ?l)
                             (at ?p ?l))
         :effect        (and (not (at ?p ?l))
                             (in ?p ?v)))

(:action unload
         :parameters    (?v - vehicle ?p - package ?l - location)
         :precondition  (and (at ?v ?l)
                             (in ?p ?v))
         :effect        (and (not (in ?p ?v))
                             (at ?p ?l)))

)

; problem
(define (problem problem_logistics_1)

(:domain logistics)

(:objects
	obj0 obj2 obj19 - airport
	obj1 obj3 - city
	obj4 obj6 - airplane
	obj5 obj7 obj8 obj10 obj11 obj12 obj13 obj15 obj16 obj17 obj18 - package
	obj9 obj14 - truck
)

(:init
	(at obj15 obj2)
	(at obj14 obj0)
	(in-city obj0 obj1)
	(at obj9 obj2)
	(at obj13 obj0)
	(at obj17 obj0)
	(at obj10 obj0)
	(at obj6 obj0)
	(in-city obj19 obj3)
	(at obj16 obj0)
	(at obj12 obj0)
	(at obj4 obj2)
	(at obj5 obj2)
	(at obj18 obj2)
	(at obj11 obj0)
	(at obj7 obj0)
	(at obj8 obj0)
	(in-city obj2 obj3)
)

(:goal (and
	(at obj7 obj2)
	(at obj10 obj2)
	(at obj8 obj2)
	(at obj18 obj0)
	(at obj15 obj0)
	(at obj17 obj2)
	(at obj5 obj0)
	(at obj12 obj2)
	(at obj13 obj19)
	(at obj11 obj2)
	(at obj16 obj19)
))
)

; plan
1. (drive obj9 obj2 obj19)
   deleted: (at obj9 obj2)
   added: (at obj9 obj19)
   goals met: 0 of 11
2. (load obj6 obj8 obj0)
   deleted: (at obj8 obj0)
   added: (in obj8 obj6)
   goals met: 0 of 11
3. (load obj6 obj7 obj0)
   deleted: (at obj7 obj0)
   added: (in obj7 obj6)
   goals met: 0 of 11
4. (load obj6 obj17 obj0)
   deleted: (at obj17 obj0)
   added: (in obj17 obj6)
   goals met: 0 of 11
5. (load obj6 obj16 obj0)
   deleted: (at obj16 obj0)
   added: (in obj16 obj6)
   goals met: 0 of 11
6. (load obj6 obj13 obj0)
   deleted: (at obj13 obj0)
   added: (in obj13 obj6)
   goals met: 0 of 11
7. (fly obj6 obj0 obj19)
   deleted: (at obj6 obj0)
   added: (at obj6 obj19)
   goals met: 0 of 11
8. (unload obj6 obj16 obj19)
   deleted: (in obj16 obj6)
   added: (at obj16 obj19)
   goals met: 1 of 11
9. (unload obj6 obj13 obj19)
   deleted: (in obj13 obj6)
   added: (at obj13 obj19)
   goals met: 2 of 11
10. (load obj4 obj5 obj2)
   deleted: (at obj5 obj2)
   added: (in obj5 obj4)
   goals met: 2 of 11
11. (load obj4 obj18 obj2)
   deleted: (at obj18 obj2)
   added: (in obj18 obj4)
   goals met: 2 of 11
12. (load obj4 obj15 obj2)
   deleted: (at obj15 obj2)
   added: (in obj15 obj4)
   goals met: 2 of 11
13. (fly obj6 obj19 obj2)
   deleted: (at obj6 obj19)
   added: (at obj6 obj2)
   goals met: 2 of 11
14. (unload obj6 obj8 obj2)
   deleted: (in obj8 obj6)
   added: (at obj8 obj2)
   goals met: 3 of 11
15. (unload obj6 obj7 obj2)
   deleted: (in obj7 obj6)
   added: (at obj7 obj2)
   goals met: 4 of 11
16. (unload obj6 obj17 obj2)
   deleted: (in obj17 obj6)
   added: (at obj17 obj2)
   goals met: 5 of 11
17. (fly obj4 obj2 obj0)
   deleted: (at obj4 obj2)
   added: (at obj4 obj0)
   goals met: 5 of 11
18. (unload obj4 obj5 obj0)
   deleted: (in obj5 obj4)
   added: (at obj5 obj0)
   goals met: 6 of 11
19. (unload obj4 obj18 obj0)
   deleted: (in obj18 obj4)
   added: (at obj18 obj0)
   goals met: 7 of 11
20. (unload obj4 obj15 obj0)
   deleted: (in obj15 obj4)
   added: (at obj15 obj0)
   goals met: 8 of 11
21. (load obj4 obj12 obj0)
   deleted: (at obj12 obj0)
   added: (in obj12 obj4)
   goals met: 8 of 11
22. (load obj4 obj11 obj0)
   deleted: (at obj11 obj0)
   added: (in obj11 obj4)
   goals met: 8 of 11
23. (load obj4 obj10 obj0)
   deleted: (at obj10 obj0)
   added: (in obj10 obj4)
   goals met: 8 of 11
24. (fly obj4 obj0 obj2)
   deleted: (at obj4 obj0)
   added: (at obj4 obj2)
   goals met: 8 of 11
25. (unload obj4 obj12 obj2)
   deleted: (in obj12 obj4)
   added: (at obj12 obj2)
   goals met: 9 of 11
26. (unload obj4 obj11 obj2)
   deleted: (in obj11 obj4)
   added: (at obj11 obj2)
   goals met: 10 of 11
27. (unload obj4 obj10 obj2)
   deleted: (in obj10 obj4)
   added: (at obj10 obj2)
   goals met: 11 of 11
